In [2]:
import numpy as np
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([1, 2, 3, -4])
obj

0    1
1    2
2    3
3   -4
dtype: int64

In [5]:
obj.array

<PandasArray>
[1, 2, 3, -4]
Length: 4, dtype: int64

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([1, 2, 3, 4],
                 index=['a', 'b', 'c', 'd'])

In [8]:
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
obj2["a"]

1

In [11]:
obj2["c"]

3

In [12]:
obj2[["a", "d"]]

a    1
d    4
dtype: int64

In [13]:
obj2[obj2> 2]

c    3
d    4
dtype: int64

In [14]:
obj2 * 2

a    2
b    4
c    6
d    8
dtype: int64

In [15]:
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
np.exp(obj2)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [17]:
"c" in obj2

True

In [18]:
'f' in obj2

False

In [19]:
sdata = {"Ohio": 1900, "Oregon": 9300, "Texas": 9584, "California": 12000}
sdata

{'Ohio': 1900, 'Oregon': 9300, 'Texas': 9584, 'California': 12000}

In [21]:
obj3 = pd.Series(sdata)

In [22]:
obj3

Ohio           1900
Oregon         9300
Texas          9584
California    12000
dtype: int64

In [24]:
obj3.to_dict()

{'Ohio': 1900, 'Oregon': 9300, 'Texas': 9584, 'California': 12000}

In [36]:
states = ["California", "Oregon", "Texas", "Utah"]

In [37]:
obj4 = pd.Series(sdata, index=states)
obj4

California    12000.0
Oregon         9300.0
Texas          9584.0
Utah              NaN
dtype: float64

In [38]:
obj4.isna()

California    False
Oregon        False
Texas         False
Utah           True
dtype: bool

In [39]:
pd.isna(obj4)

California    False
Oregon        False
Texas         False
Utah           True
dtype: bool

In [40]:
pd.notna(obj4)

California     True
Oregon         True
Texas          True
Utah          False
dtype: bool

In [41]:
obj4

California    12000.0
Oregon         9300.0
Texas          9584.0
Utah              NaN
dtype: float64

In [43]:
obj3 + obj4

California    24000.0
Ohio              NaN
Oregon        18600.0
Texas         19168.0
Utah              NaN
dtype: float64

In [44]:
obj4.name = 'Population'
obj4.index.name = "State"

In [45]:
obj4

State
California    12000.0
Oregon         9300.0
Texas          9584.0
Utah              NaN
Name: Population, dtype: float64

In [46]:
obj

0    1
1    2
2    3
3   -4
dtype: int64

In [50]:
data = {"State": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
       "Year": [2001, 2002, 2003, 2001, 2002, 2003],
       "Population": [1.2, 1.3, 1.4, 1.4, 2.1, 2.3]}

In [53]:
frame = pd.DataFrame(data)

In [54]:
frame

    State  Year  Population
0    Ohio  2001         1.2
1    Ohio  2002         1.3
2    Ohio  2003         1.4
3  Nevada  2001         1.4
4  Nevada  2002         2.1
5  Nevada  2003         2.3

In [55]:
frame.head()

    State  Year  Population
0    Ohio  2001         1.2
1    Ohio  2002         1.3
2    Ohio  2003         1.4
3  Nevada  2001         1.4
4  Nevada  2002         2.1

In [56]:
frame.tail()

    State  Year  Population
1    Ohio  2002         1.3
2    Ohio  2003         1.4
3  Nevada  2001         1.4
4  Nevada  2002         2.1
5  Nevada  2003         2.3

In [57]:
frame1 = pd.DataFrame(data, columns=["State", "Population", "Year", "debt"])

In [58]:
frame1

    State  Population  Year debt
0    Ohio         1.2  2001  NaN
1    Ohio         1.3  2002  NaN
2    Ohio         1.4  2003  NaN
3  Nevada         1.4  2001  NaN
4  Nevada         2.1  2002  NaN
5  Nevada         2.3  2003  NaN

In [59]:
frame1.columns

Index(['State', 'Population', 'Year', 'debt'], dtype='object')

In [60]:
frame1["State"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: State, dtype: object

In [63]:
frame1.Year

0    2001
1    2002
2    2003
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [67]:
frame1.loc[2]

State         Ohio
Population     1.4
Year          2003
debt           NaN
Name: 2, dtype: object

In [69]:
frame1.iloc[2]

State         Ohio
Population     1.4
Year          2003
debt           NaN
Name: 2, dtype: object

In [70]:
frame1["debt"] = 16.5

In [71]:
frame1

    State  Population  Year  debt
0    Ohio         1.2  2001  16.5
1    Ohio         1.3  2002  16.5
2    Ohio         1.4  2003  16.5
3  Nevada         1.4  2001  16.5
4  Nevada         2.1  2002  16.5
5  Nevada         2.3  2003  16.5

In [75]:
frame1.debt = np.arange(6.)

In [76]:
frame1

    State  Population  Year  debt
0    Ohio         1.2  2001   0.0
1    Ohio         1.3  2002   1.0
2    Ohio         1.4  2003   2.0
3  Nevada         1.4  2001   3.0
4  Nevada         2.1  2002   4.0
5  Nevada         2.3  2003   5.0

In [78]:
val = pd.Series([-1.2, 1.3, 2.1], index=[2, 4, 5])

In [79]:
frame1.debt = val

In [80]:
frame1

    State  Population  Year  debt
0    Ohio         1.2  2001   NaN
1    Ohio         1.3  2002   NaN
2    Ohio         1.4  2003  -1.2
3  Nevada         1.4  2001   NaN
4  Nevada         2.1  2002   1.3
5  Nevada         2.3  2003   2.1

In [81]:
frame1['Eastern'] = frame1['State'] == 'Ohio'

In [83]:
frame1

    State  Population  Year  debt  Eastern
0    Ohio         1.2  2001   NaN     True
1    Ohio         1.3  2002   NaN     True
2    Ohio         1.4  2003  -1.2     True
3  Nevada         1.4  2001   NaN    False
4  Nevada         2.1  2002   1.3    False
5  Nevada         2.3  2003   2.1    False

In [85]:
del frame1['Eastern']

In [87]:
frame1

    State  Population  Year  debt
0    Ohio         1.2  2001   NaN
1    Ohio         1.3  2002   NaN
2    Ohio         1.4  2003  -1.2
3  Nevada         1.4  2001   NaN
4  Nevada         2.1  2002   1.3
5  Nevada         2.3  2003   2.1

In [88]:
frame1.columns

Index(['State', 'Population', 'Year', 'debt'], dtype='object')

If the nested dictionary is passed to the DataFrame, pandas will interpret the outer dictionary keys as the columns, and the inner keys as the row indices:

In [89]:
populations = {"Ohio": {2001: 1.2, 2002: 1.5, 2003: 2.1},
              "Nevada": {2002: 3.0, 2003: 4.1}}

In [91]:
frame2 = pd.DataFrame(populations)

In [92]:
frame2

      Ohio  Nevada
2001   1.2     NaN
2002   1.5     3.0
2003   2.1     4.1

In [93]:
frame2.T

        2001  2002  2003
Ohio     1.2   1.5   2.1
Nevada   NaN   3.0   4.1

In [94]:
frame2.dtypes

Ohio      float64
Nevada    float64
dtype: object

In [95]:
frame2.T.dtypes

2001    float64
2002    float64
2003    float64
dtype: object

In [96]:
populations

{'Ohio': {2001: 1.2, 2002: 1.5, 2003: 2.1}, 'Nevada': {2002: 3.0, 2003: 4.1}}

In [97]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.2     NaN
2002   1.5     3.0
2003   2.1     4.1

In [101]:
frame2["Ohio"][:-1]

2001    1.2
2002    1.5
Name: Ohio, dtype: float64

In [103]:
frame2["Nevada"][:2]

2001    NaN
2002    3.0
Name: Nevada, dtype: float64

In [109]:
pdata = {"Ohio": frame2["Ohio"][:-1],
        "Nevada": frame2["Nevada"][:2]}

In [110]:
pdata

{'Ohio': 2001    1.2
 2002    1.5
 Name: Ohio, dtype: float64,
 'Nevada': 2001    NaN
 2002    3.0
 Name: Nevada, dtype: float64}

In [111]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.2     NaN
2002   1.5     3.0

In [113]:
frame2.index.name = "Year"
frame2.columns.name = "State"

In [114]:
frame2

State  Ohio  Nevada
Year
2001    1.2     NaN
2002    1.5     3.0
2003    2.1     4.1

In [115]:
frame2.to_numpy()

array([[1.2, nan],
       [1.5, 3. ],
       [2.1, 4.1]])

In [116]:

frame1

    State  Population  Year  debt
0    Ohio         1.2  2001   NaN
1    Ohio         1.3  2002   NaN
2    Ohio         1.4  2003  -1.2
3  Nevada         1.4  2001   NaN
4  Nevada         2.1  2002   1.3
5  Nevada         2.3  2003   2.1

In [117]:
frame1.to_numpy()

array([['Ohio', 1.2, 2001, nan],
       ['Ohio', 1.3, 2002, nan],
       ['Ohio', 1.4, 2003, -1.2],
       ['Nevada', 1.4, 2001, nan],
       ['Nevada', 2.1, 2002, 1.3],
       ['Nevada', 2.3, 2003, 2.1]], dtype=object)

## Index Object

In [118]:
obj = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])

In [119]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [120]:
index =obj.index

In [121]:
index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [122]:
index[1:]

Index(['b', 'c', 'd'], dtype='object')

In [125]:
index[1] = 'e' # index objects are immutable

TypeError: Index does not support mutable operations

In [126]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [127]:
obj2 = pd.Series([1.2, 4.5, 0.9], index=labels)
obj2

0    1.2
1    4.5
2    0.9
dtype: float64

In [129]:
obj2.index is labels

True

In [130]:
frame2

State  Ohio  Nevada
Year
2001    1.2     NaN
2002    1.5     3.0
2003    2.1     4.1

In [131]:
frame2.columns

Index(['Ohio', 'Nevada'], dtype='object', name='State')

In [132]:
frame2.index

Int64Index([2001, 2002, 2003], dtype='int64', name='Year')

In [133]:
"Ohio" in frame2.columns

True

In [134]:
2003 in frame2.index

True

In [135]:
pd.Index(["foo", "foo", "bar", 'bar'])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [136]:
obj = pd.Series(np.arange(5), index=['b', 'c', 'e', 'a', 'd'])

In [137]:
obj

b    0
c    1
e    2
a    3
d    4
dtype: int32

In [141]:
obj2 = obj.reindex(['a', 'b', 'c', 'd','e', 'f'])

In [142]:
obj2

a    3.0
b    0.0
c    1.0
d    4.0
e    2.0
f    NaN
dtype: float64

In [149]:
obj3 = pd.Series(['blue', 'purple', 'black'], index=[0, 2, 4])
obj3

0      blue
2    purple
4     black
dtype: object

In [155]:
obj3.reindex(np.arange(10), method='ffill') #forward fill

0      blue
1      blue
2    purple
3    purple
4     black
5     black
6     black
7     black
8     black
9     black
dtype: object

In [157]:
obj3.reindex(np.arange(7), method = 'bfill') # back fill

0      blue
1    purple
2    purple
3     black
4     black
5       NaN
6       NaN
dtype: object

In [158]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index = ['a', 'b', 'c'],
                    columns=['Ohio','California', 'Texas'])

In [159]:
frame

   Ohio  California  Texas
a     0           1      2
b     3           4      5
c     6           7      8

In [163]:
frame.reindex(['c', 'b', 'a', 's'])

   Ohio  California  Texas
c   6.0         7.0    8.0
b   3.0         4.0    5.0
a   0.0         1.0    2.0
s   NaN         NaN    NaN

In [164]:
frame

   Ohio  California  Texas
a     0           1      2
b     3           4      5
c     6           7      8

In [165]:
frame.reindex(columns=['Utah', 'Texas', 'Ohio'])

   Utah  Texas  Ohio
a   NaN      2     0
b   NaN      5     3
c   NaN      8     6

In [166]:
states = ['California', 'Ohio', 'Utah']
frame.reindex(states, axis="columns")

   California  Ohio  Utah
a           1     0   NaN
b           4     3   NaN
c           7     6   NaN

In [168]:
frame.loc[['a', 'c'], 
         ['Texas', 'Ohio']]

   Texas  Ohio
a      2     0
c      8     6

In [171]:
pd.DataFrame(np.arange(20).reshape((5, 4)),
            columns=['t1', 't2', 't3', 't4'], 
            index=['a', 'b', 'c', 'd', 'e'])

   t1  t2  t3  t4
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e  16  17  18  19

## Dropping Entries from Axis

In [179]:
obj = pd.Series(np.arange(5.), index = ['a', 'b','c', 'd', 'e'])

In [180]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [181]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [182]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [183]:
new_obj = obj.drop('c')

In [184]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [185]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
                   index=['Ohio', 'California', 'Utah', 'Texas'],
                   columns=['one', 'two', 'three', 'four'])

In [186]:
data

            one  two  three  four
Ohio          0    1      2     3
California    4    5      6     7
Utah          8    9     10    11
Texas        12   13     14    15

In [189]:
data.drop("one", axis=1)

            two  three  four
Ohio          1      2     3
California    5      6     7
Utah          9     10    11
Texas        13     14    15

In [192]:
data.drop(['Ohio', 'Texas'], axis=0)

            one  two  three  four
California    4    5      6     7
Utah          8    9     10    11

In [193]:
data.drop(columns=["two", 'three'])

            one  four
Ohio          0     3
California    4     7
Utah          8    11
Texas        12    15

In [194]:
data.drop(index=['Utah', 'Ohio'])

            one  two  three  four
California    4    5      6     7
Texas        12   13     14    15

## Indexing, Selection and Filtering

In [195]:
obj = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])

In [196]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [197]:
obj[1]

1

In [198]:
obj[2:4]

c    2
d    3
dtype: int32

In [199]:
obj["b"]

1

In [200]:
obj[['b', 'd']]

b    1
d    3
dtype: int32

In [201]:
obj[[1, 3]]

b    1
d    3
dtype: int32

In [202]:
obj[obj<3]

a    0
b    1
c    2
dtype: int32

In [206]:
obj.loc[['b', 'c', 'd']]

b    1
c    2
d    3
dtype: int32

In [211]:
obj.loc[['b', 'c']]

b    1
c    2
dtype: int32

When using loc, the expression obj.loc[[0, 1, 2]] will fail when the index does not contain integers:

In [213]:
#obj.loc[[1, 2]] 
# will recieve an error

Since loc operator indexes exclusively with labels, there is also an iloc operator that indexes exclusively with integers to work consistently whether or not the index contains integers:

In [214]:
obj.iloc[[1, 2, 3]]

b    1
c    2
d    3
dtype: int32

In [216]:
obj['b':'c']

b    1
c    2
dtype: int32

In [217]:
obj['b':'c'] =5

In [218]:
obj

a    0
b    5
c    5
d    3
dtype: int32

In [219]:
data

            one  two  three  four
Ohio          0    1      2     3
California    4    5      6     7
Utah          8    9     10    11
Texas        12   13     14    15

In [221]:
data['two']

Ohio           1
California     5
Utah           9
Texas         13
Name: two, dtype: int32

In [222]:
data[['three', 'one']]

            three  one
Ohio            2    0
California      6    4
Utah           10    8
Texas          14   12

In [233]:
data[(data['three'] > 5 ) & (data['four'] > 7)]

       one  two  three  four
Utah     8    9     10    11
Texas   12   13     14    15

In [234]:
data < 5

              one    two  three   four
Ohio         True   True   True   True
California   True  False  False  False
Utah        False  False  False  False
Texas       False  False  False  False

In [235]:
data[data < 5] = 0

In [236]:
data

            one  two  three  four
Ohio          0    0      0     0
California    0    5      6     7
Utah          8    9     10    11
Texas        12   13     14    15

In [237]:
data.loc['Utah', ['one', 'four']]

one      8
four    11
Name: Utah, dtype: int32

In [238]:
data.iloc[1]

one      0
two      5
three    6
four     7
Name: California, dtype: int32

In [240]:
data.iloc[[2, 3]]

       one  two  three  four
Utah     8    9     10    11
Texas   12   13     14    15

In [241]:
data.iloc[2, [3,0, 1
             ]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [242]:
data.loc[:'Utah', 'two']

Ohio          0
California    5
Utah          9
Name: two, dtype: int32

In [244]:
data.iloc[:, :3][data.three > 5]

            one  two  three
California    0    5      6
Utah          8    9     10
Texas        12   13     14

In [245]:
ser = pd.Series(np.arange(5.))
ser

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [247]:
ser2 = pd.Series(np.arange(3), index=['a', 'b', 'c'])
ser2

a    0
b    1
c    2
dtype: int32

In [251]:
ser2[-1]

2

In [255]:
data.loc[:, : 'two'] =2

In [259]:
data.loc[:,'one'] =1

In [260]:
data

            one  two  three  four
Ohio          1    2      0     0
California    1    2      6     7
Utah          1    2     10    11
Texas         1    2     14    15

In [262]:
data.loc['Utah'] = 5

In [263]:
data

            one  two  three  four
Ohio          1    2      0     0
California    1    2      6     7
Utah          5    5      5     5
Texas         1    2     14    15

In [265]:
data.loc[data['four'] > 5] = 3

In [266]:
data

            one  two  three  four
Ohio          1    2      0     0
California    3    3      3     3
Utah          5    5      5     5
Texas         3    3      3     3

In [269]:
data.loc[data.three == 5]['three'] = 6

<ipython-input-269-2aff7b9a150a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]['three'] = 6

In [271]:
data.loc['Utah', 'three'] = 6

In [273]:
data

            one  two  three  four
Ohio          1    2      0     0
California    3    3      3     3
Utah          5    5      6     5
Texas         3    3      3     3

## Arithmatic and Data Alignment

In [274]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])

In [275]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [294]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('abc'),
                  index=['Ohio', 'Texas', 'Utah'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('aec'),
                  index=['Ohio', 'Texas', 'Utah', 'california'])

In [295]:
df1

         a    b    c
Ohio   0.0  1.0  2.0
Texas  3.0  4.0  5.0
Utah   6.0  7.0  8.0

In [296]:
df1 + df2

               a   b     c   e
Ohio         0.0 NaN   4.0 NaN
Texas        6.0 NaN  10.0 NaN
Utah        12.0 NaN  16.0 NaN
california   NaN NaN   NaN NaN

In [302]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

In [303]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [305]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [308]:
df2.loc[1, 'b'] = np.nan

In [309]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [310]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [319]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [320]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [321]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [326]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## Operations between Dataframes and Series

In [341]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [342]:
arr[0]

array([0., 1., 2., 3.])

In [343]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [344]:
[arr[i][k] for i in range(3) for k in range(3)]

[0.0, 1.0, 2.0, 4.0, 5.0, 6.0, 8.0, 9.0, 10.0]

In [346]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bcd'), 
                                           index=['Ohio', 'Texas', 'Utah', 'London'])

In [347]:
frame

          b     c     d
Ohio    0.0   1.0   2.0
Texas   3.0   4.0   5.0
Utah    6.0   7.0   8.0
London  9.0  10.0  11.0

In [350]:
series = frame.iloc[0]

In [351]:
series

b    0.0
c    1.0
d    2.0
Name: Ohio, dtype: float64

In [352]:
frame - series

          b    c    d
Ohio    0.0  0.0  0.0
Texas   3.0  3.0  3.0
Utah    6.0  6.0  6.0
London  9.0  9.0  9.0

## Function Application And Mapping

In [354]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)), 
                    columns=list('bde'),
                    index = ['Ohio', 'Texas', 'Californio', 'Oregon'])

In [355]:
frame

                   b         d         e
Ohio       -1.895500 -0.940978 -0.862348
Texas       0.297647  0.387134 -2.256203
Californio  0.016672 -0.612767 -1.355895
Oregon     -1.181265  1.030838  1.543175

In [356]:
np.abs(frame)

                   b         d         e
Ohio        1.895500  0.940978  0.862348
Texas       0.297647  0.387134  2.256203
Californio  0.016672  0.612767  1.355895
Oregon      1.181265  1.030838  1.543175

In [357]:
def f1(x):
    return x.max() - x.min()

In [359]:
frame.max() - frame.min()

b    2.193147
d    1.971816
e    3.799378
dtype: float64

In [361]:
frame.apply(f1)

b    2.193147
d    1.971816
e    3.799378
dtype: float64